---
type: RebarSystemSpanSymbol
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 2
tags: [revit-api, class]
---

# RebarSystemSpanSymbol

`Autodesk.Revit.DB.Structure.RebarSystemSpanSymbol` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `public static RebarSystemSpanSymbol Create ( Document document , ElementId viewId , LinkElementId hostId , XYZ point , ElementId symbolId )` |
| Property | Parameter | — | `` |